#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3304da8b-80ef-4cad-8731-3bdffaa5841d]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ac232062-3966-4084-a304-352b25335404]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1063a59d-6c8c-4926-b66b-092fa4a9d848]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8a805fc-2b9b-403a-be71-8c398e41403b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04c24d57-2ce2-4f79-8d82-44eaed51cde6]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7664b246-131a-4659-afb6-dd33d238f10b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a1046b2-f84f-478d-8660-daf21b43de9c]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=188902ed-1a01-4c05-857f-0542d0aaa6a8]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=29c31071-4721-4ed8-9b88-ab905834d781]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbda9228-eca7-4baa-aed5-35ecb89dbfc0]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f277076c-8336-4aba-8955-68552c9b4a20]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7e23abfa-23b9-43e5-b30c-510340dd945f]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc5578d8-23c2-42ea-93fa-ad59f7bc2853]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=95fbc698-8903-4cf2-94ce-2f7de1f5f4d8]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f719b6cf-4634-436c-98b3-70afedf11188]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62c33ff0-61c5-478f-bcff-60cc6b08bf46]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=487ca7bf-51f5-4f7a-b597-b5b787511949]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4207d8-507b-4397-a0c9-2595adb3f370]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5647501e-c4cf-41b9-a15b-d976937a897a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c381275-dcdd-4bac-857d-f7e90a7b6b04]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=00f73562-d869-4365-8ff1-a5328d8b092c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6c596cc-08f6-4991-904d-7799362900a6]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=768c078d-e00b-4422-9cec-531e24f047e3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=679ae43c-b1ff-4f7c-9eab-fe33f7400449]
module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65171f2d-1e26-4d50-9771-e61febab078b]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bfe589e7-3732-4d61-aee0-a07a84189c09]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9df5f527-fa67-43db-b91d-944e536048e0]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8b1983e-0d63-4a47-a80b-f9b190afc0df]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4114113f-96a1-4ed1-a546-cb51030a9224]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8407b7a5-b88c-4fd1-b965-047e91d9ff1d]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96d101df-2c22-4eb6-a367-f89fbe7e2037]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=01dcb62a-ec3f-42d6-be9c-6fb5173640b3]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1e725f9-45a8-439b-95ba-f248757e8911]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7a76ea10-1efd-496f-b12c-0389e2b28055]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d7cc3f91-a3f8-4c10-b7ff-53f5cb5dcc9f]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e77da751-8434-416c-88ca-875a02fe3666]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2c92295f-b617-4a8b-abce-d78f46906de4]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b1f0bc5e-7fd8-4bb5-b40f-ac951a36fa21]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=22d2ffc0-450d-4538-a161-cbc18a7070b9]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=feb7c095-fc9f-4eeb-b78f-acc5e18bc299]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=15395e35-9180-4fdd-9187-cd59ec234f35]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=44bad374-783b-4082-b719-4fb0baa11833]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3eed2f23-f733-496a-89e2-ef490e888f9c]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a62d9bc7-b344-426d-a97f-df22a73eb9c2]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=61ed3d38-f426-4931-bb27-fa37dfb5865b]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=31fe8470-428e-40a3-ad44-44ece7a3202b]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e4acccb2-a54f-466f-afd3-00242ea45591]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bb08ebd-b4cb-4d44-b60c-0e21d419f6da]
module.keycloak_prod.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a5d6f95e-4b59-4757-8bd8-c30bc3bcece7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-9-3-21-1486"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-9-3-21-1486"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-9-3-21-1486"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-9-3-21-1486"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-9-3-21-1486"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-9-3-21-1486"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-9-3-21-1486"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-9-3-21-1486"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-9-3-21-1486"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1925 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*